Revit 2027 API
Category.IsBuiltInCategory Method
 Checks whether a ForgeTypeId identifies a built-in category.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsBuiltInCategory(
	ForgeTypeId categoryTypeId
)
Public Shared Function IsBuiltInCategory (
	categoryTypeId As ForgeTypeId
) As Boolean
public:
static bool IsBuiltInCategory(
	ForgeTypeId^ categoryTypeId
)
static member IsBuiltInCategory :
        categoryTypeId : ForgeTypeId -> bool
Parameters
categoryTypeId ForgeTypeId
 The identifier to check.
Return Value
Boolean
 True if the ForgeTypeId identifies a built-in category, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 A ForgeTypeId identifies a built-in category if it corresponds to a valid BuiltInCategory value according to Category.IsBuiltInCategoryValid(BuiltInCategory) and Category.GetBuiltInCategoryTypeId(BuiltInCategory).
See Also
Reference
Category Class
Autodesk.Revit.DB Namespace